Revit 2024 API
ParameterTypeId.RbsElecCircuitWireTypeParam Property
 "Wire Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsElecCircuitWireTypeParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecCircuitWireTypeParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecCircuitWireTypeParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace